# RbsEnergyAnalysisSurfaceOriginZ Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsEnergyAnalysisSurfaceOriginZ Property
ParameterTypeId Class See Also
---
"Origin (Z)"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsEnergyAnalysisSurfaceOriginZ { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsEnergyAnalysisSurfaceOriginZ As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsEnergyAnalysisSurfaceOriginZ {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace